# 01 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [9]:
import numpy as np 
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [10]:
csv = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user")
csv

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [11]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries
Solve it by 2 different ways

In [12]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [13]:
users.loc[1:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [14]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?
Solve it by 2 different ways

In [18]:
print(len(users))
print(users.shape[0])

943
943

### Step 7. What is the number of columns in the dataset?
Solve it by 2 different ways

In [21]:
print(len(users.columns))
print(users.shape[1])

4
4

### Step 8. Print the name of all the columns.

In [24]:
print(users.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed? Get the index values

In [25]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?
Solve it by 2 different ways

In [26]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [49]:
print(type(users.columns[0]))
print(type(users.columns[1]))
print(type(users.columns[2]))
print(type(users.columns[3]))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

### Step 11. Print only the occupation column
Solve it by 2 different ways

In [50]:
print(users["occupation"])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [51]:
for v in users["occupation"]:
    print(v)

technician
other
writer
technician
other
executive
administrator
administrator
student
lawyer
other
other
educator
scientist
educator
entertainment
programmer
other
librarian
homemaker
writer
writer
artist
artist
engineer
engineer
librarian
writer
programmer
student
artist
student
student
administrator
homemaker
student
student
other
entertainment
scientist
engineer
administrator
librarian
technician
programmer
marketing
marketing
administrator
student
writer
educator
student
programmer
executive
programmer
librarian
none
programmer
educator
healthcare
engineer
administrator
marketing
educator
educator
student
student
student
engineer
engineer
scientist
administrator
student
scientist
entertainment
student
technician
administrator
administrator
administrator
student
programmer
other
executive
educator
administrator
administrator
librarian
administrator
educator
marketing
entertainment
executive
student
administrator
artist
artist
executive
student
executive
student
programmer
student
student
engineer
retired
scientist
educator
other
student
engineer
salesman
executive
programmer
engineer
healthcare
student
administrator
programmer
other
librarian
writer
artist
student
lawyer
lawyer
none
marketing
marketing
none
administrator
other
engineer
programmer
student
other
educator
doctor
student
student
programmer
other
technician
programmer
entertainment
artist
librarian
engineer
marketing
artist
administrator
educator
student
student
other
educator
engineer
educator
student
programmer
lawyer
artist
administrator
healthcare
other
educator
other
other
other
healthcare
educator
marketing
other
administrator
scientist
scientist
programmer
other
entertainment
administrator
executive
programmer
scientist
librarian
librarian
executive
educator
student
artist
administrator
administrator
educator
student
administrator
scientist
writer
technician
student
writer
programmer
writer
educator
student
librarian
lawyer
student
marketing
engineer
educator
engineer
salesman
educator
executive
librarian
programmer
engineer
other
administrator
programmer
librarian
student
programmer
student
educator
administrator
student
executive
student
librarian
student
librarian
scientist
engineer
retired
educator
writer
administrator
administrator
artist
educator
student
educator
educator
technician
student
student
engineer
student
student
executive
doctor
engineer
librarian
educator
entertainment
none
student
student
student
artist
administrator
student
programmer
writer
executive
administrator
engineer
engineer
librarian
student
engineer
scientist
other
student
engineer
student
administrator
librarian
programmer
librarian
student
administrator
programmer
executive
programmer
student
salesman
marketing
none
engineer
student
programmer
writer
technician
educator
administrator
educator
executive
doctor
programmer
student
educator
student
student
programmer
other
student
retired
scientist
educator
technician
other
marketing
student
educator
other
administrator
retired
programmer
student
educator
student
student
student
technician
administrator
student
administrator
educator
educator
entertainment
student
other
librarian
executive
salesman
scientist
librarian
lawyer
engineer
student
other
engineer
librarian
librarian
other
student
student
retired
student
educator
programmer
scientist
librarian
student
homemaker
executive
educator
student
other
student
homemaker
student
engineer
lawyer
student
student
student
student
writer
engineer
student
other
executive
entertainment
other
student
student
programmer
engineer
artist
engineer
administrator
programmer
writer
salesman
entertainment
other
writer
writer
student
writer
student
administrator
other
engineer
student
other
other
administrator
healthcare
engineer
other
programmer
healthcare
educator
engineer
student
administrator
artist
educator
educator
educator
programmer
educator
student
other
none
lawyer
educator
programmer
entertainment
other
marketing
student
educator
doctor
student
student
scientist
marketing
entertainment
artist
student
engineer
administrator
other
administrator
administrator
other
technician
student
salesman
lawyer
writer
educator
administrator
entertainment
librarian
educator
student
administrator
student
other
administrator
technician
salesman
technician
student
other
student
student
healthcare
writer
other
student
engineer
engineer
educator
programmer
student
student
student
executive
programmer
student
student
other
educator
retired
retired
student
scientist
student
educator
educator
engineer
technician
other
artist
writer
educator
engineer
administrator
engineer
student
student
writer
programmer
administrator
student
student
writer
writer
other
programmer
writer
marketing
administrator
other
student
other
administrator
programmer
marketing
librarian
student
writer
other
healthcare
student
engineer
administrator
educator
administrator
marketing
librarian
student
administrator
engineer
salesman
student
librarian
student
educator
engineer
engineer
scientist
administrator
engineer
student
student
scientist
other
technician
executive
educator
writer
scientist
student
programmer
other
educator
scientist
educator
educator
writer
writer
executive
student
engineer
administrator
librarian
retired
student
student
entertainment
educator
educator
educator
artist
educator
retired
educator
marketing
executive
student
administrator
educator
student
other
student
engineer
student
librarian
student
other
student
lawyer
educator
librarian
student
educator
educator
programmer
artist
other
marketing
student
programmer
artist
other
programmer
educator
engineer
programmer
healthcare
other
student
student
librarian
educator
marketing
educator
educator
scientist
writer
student
student
writer
student
programmer
educator
student
programmer
scientist
engineer
none
other
healthcare
student
student
programmer
engineer
other
educator
other
engineer
librarian
student
student
student
scientist
retired
programmer
student
educator
engineer
student
engineer
retired
other
executive
student
healthcare
educator
none
programmer
educator
student
programmer
librarian
other
engineer
administrator
administrator
librarian
writer
other
technician
programmer
administrator
educator
student
other
programmer
other
educator
student
lawyer
marketing
programmer
librarian
student
librarian
educator
healthcare
administrator
other
salesman
educator
engineer
healthcare
programmer
writer
other
other
programmer
other
student
librarian
other
educator
librarian
student
student
librarian
homemaker
other
student
student
student
other
engineer
technician
administrator
technician
technician
other
administrator
entertainment
homemaker
executive
executive
student
administrator
student
executive
student
scientist
educator
other
other
other
healthcare
writer
programmer
technician
technician
educator
writer
student
programmer
marketing
writer
engineer
other
administrator
other
administrator
other
retired
salesman
librarian
educator
none
student
student
student
other
student
administrator
scientist
educator
student
other
engineer
administrator
executive
student
student
writer
student
student
executive
librarian
programmer
student
student
programmer
student
artist
marketing
administrator
engineer
engineer
student
administrator
other
technician
educator
programmer
student
educator
programmer
writer
other
writer
administrator
programmer
writer
administrator
administrator
educator
other
marketing
healthcare
salesman
marketing
other
educator
technician
student
other
other
other
student
librarian
administrator
student
engineer
librarian
artist
other
engineer
artist
engineer
librarian
writer
programmer
other
technician
writer
other
executive
artist
artist
student
entertainment
artist
doctor
writer
librarian
engineer
doctor
lawyer
student
engineer
student
technician
other
administrator
writer
student
librarian
marketing
administrator
educator
other
retired
student
executive
student
programmer
artist
other
scientist
programmer
student
student
executive
student
administrator
scientist
student
other
other
educator
administrator
student
marketing
engineer
librarian
engineer
other
student
student
scientist
technician
student
administrator
other
student
educator
librarian
writer
other
homemaker
other
retired
executive
artist
educator
student
other
librarian
other
librarian
educator
healthcare
writer
other
student
other
entertainment
engineer
student
scientist
other
artist
student
administrator
student
other
salesman
entertainment
programmer
student
scientist
scientist
educator
educator
student
engineer
doctor
other
educator
technician
student
administrator
student
librarian
student

### Step 12. How many different occupations are in this dataset? How many users per occupation are in the dataset?

In [54]:
set(users["occupation"])

{'administrator',
 'artist',
 'doctor',
 'educator',
 'engineer',
 'entertainment',
 'executive',
 'healthcare',
 'homemaker',
 'lawyer',
 'librarian',
 'marketing',
 'none',
 'other',
 'programmer',
 'retired',
 'salesman',
 'scientist',
 'student',
 'technician',
 'writer'}

In [58]:
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### Step 13. What is the most frequent occupation?

In [60]:
users['occupation'].mode()

0    student
dtype: object

### Step 14. Summarize the DataFrame.

In [65]:
users.nunique()

age            61
gender          2
occupation     21
zip_code      795
dtype: int64

In [62]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

### Step 15. Summarize all the columns

In [61]:
users.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [64]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

### Step 17. What is the mean age of users?

In [67]:
users["age"].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [73]:
c = users.age.value_counts()
c.index[-1]

73

In [75]:
users.age.value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
10     1
11     1
73     1
Name: age, Length: 61, dtype: int64